{
  "main": {
    "fullname": "Ahmad Khan",
    "name": "Ahmad",
    "occupation": "Full Stack Developer",
    "description": "; recently my Codeplus team developed a web application allowing students to request or donate their food points. I'm currently also working alongside Duke Men's Basketball to develop a web & mobile shift scheduling application. You can read more about these applications and my other works ",
    "image": "profilepic.jpg",
    "bio": "Hello! I'm an undergraduate at Duke studying Computer Science. I am fascinated by all kinds of technology, especially software! I will take any and every opportunity that I can to learn, be it reading car manuals cover to cover or listening to others' life stories. In my free time I love going on bike rides, window shopping for shoes and building computers. My goal as a software engineer is to produce reliable and readable code but more importantly, work towards becoming a better developer and team member every day.",
    "contactmessage": "Get in touch with me using the form below: ",
    "email": "akhanduke@gmail.com",
    "phone": "",
    "address": {
      "street": "",
      "city": "Chicago",
      "state": "IL",
      "zip": ""
    },
    "website": "",
    "resumedownload": "./images/SWE.pdf",
    "social": [
      {
        "name": "email",
        "url": "mailto:akhanduke@gmail.com",
        "className": "fa fa-envelope"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/ahmadkhanduke/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/Akhan221",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here are some of the skills that I am proficient in: ",
    "education": [
      {
        "school": "Duke University",
        "degree": "B.S in Computer Science",
        "graduated": "May 2022",
        "description": "President of Game Tenting Help Center, Member of Duke Applied Machine Learning, Muslim Student Association, Alpha Phi Omega, Questbridge Scholar"
      }
    ],
    "work": [
      {
        "company": "Food Point Donation Program: Feed Every Devil",
        "title": "Software Engineer",
        "years": "May 2020 - Present",
        "description": "Developed web application using Ruby on Rails, jQuery, and Transact API to allow students to donate food points to those in need. Authored onboarding documenation for future developers, held daily standups to delegate programming tasks to team members"
      },
      {
        "company": "Duke School of Medicine",
        "title": "IT Technician",
        "years": "January 2019 - Present",
        "description": "Responsible for troubleshooting Windows and Apple products for Duke Medical students, as well as overseeing Duke Medical students' devices using Jamf and Airwatch to ensure security compliance"
      },
      {
        "company": "GTHC: Game Tenting Help Center",
        "title": "President",
        "years": "December 2019 - Present",
        "description": "Responsible for developer recruiting/onboarding, application design, task delegation among SW teams and assisting members with programming difficulties as needed"
      }
    ],
    "skills": [
      {
        "name": "Java",
        "level": "70%"
      },
      {
        "name": "Python",
        "level": "70%"
      },
      {
        "name": "ReactJs",
        "level": "60%"
      },
      {
        "name": "HTML/CSS",
        "level": "70%"
      },
      {
        "name": "Linux",
        "level": "50%"
      },
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Troubleshooting",
        "level": "90%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Feed Every Devil",
        "category": "Skills Used: Ruby on Rails, JavaScript, jQuery, PostgreSQL, REST API",
        "image": "FEDlogo.png",
        "url": "/fed"
      },
      {
        "title": "Game Tenting Help Center",
        "category": "Skills Used: React, React-Router, Ruby on Rails, Ubuntu",
        "image": "gthc.png",
        "url": "https://gthc.io"
      },
      {
        "title": "Work Together",
        "category": "React, React-Router, Node.js",
        "image": "woto_logo.jpg",
        "url": "https://wototime.com"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}