{
  "main": {
    "fullname": "Ahmad Khan",
    "name": "Ahmad",
    "occupation": "Full Stack Developer",
    "description": "; I am currently a Software Engineer for Duke OIT, developing a web application allowing students to request or donate their food points. I'm currently also working alongside Duke Men's Basketball to develop a web & mobile shift scheduling application. You can read more about these applications and my other work ",
    "image": "profilepic.jpg",
    "bio": "Hello! I'm an undergraduate at Duke University studying Computer Science. I am fascinated by all kinds of technology, especially software! I will take any and every opportunity that I can to learn, be it reading car manuals cover to cover or watching tech product reviews. In my free time I love going on bike rides, window shopping for shoes and building computers. My goal as a software engineer is to produce performant and responsive products but more importantly, work towards becoming a better developer and team member every day.",
    "contactmessage": "Get in touch with me using the form below: ",
    "email": "akhanduke@gmail.com",
    "phone": "",
    "address": {
      "street": "",
      "city": "Chicago",
      "state": "IL",
      "zip": ""
    },
    "website": "",
    "resumedownload": "https://www.dropbox.com/s/7ff5ry9u4autz4g/SWE%20Resume.pdf?dl=0",
    "social": [
      {
        "name": "email",
        "url": "mailto:akhanduke@gmail.com",
        "className": "fa fa-envelope"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/ahmadkhanduke/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/Akhan221",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I am proficient in these skills: ",
    "education": [
      {
        "school": "Duke University",
        "degree": "B.S in Computer Science",
        "graduated": "May 2022",
        "gpa": "Cumulative GPA: 3.53",
        "description": "President of Game Tenting Help Center, Member of Duke Applied Machine Learning, Muslim Student Association, Alpha Phi Omega, Questbridge Scholar, Summit United Mentor"
      }
    ],
    "work": [
      {
        "company": "Duke Office of Information Technology",
        "title": "Software Engineer",
        "years": "May 2020 - Present",
        "description": "Remote internship focused on development of web application using Ruby on Rails, JavaScript, and Transact API allowing students to donate food points to food insecure peers. Responsible for writing documentation for admin users & new devlopers, developing responsive webpages. Implemented Ruby backend for admin system that reviews and approves requests for food points. Trained team in Git, led daily standups to delegate tasks and discuss application design."
      },
      {
        "company": "GTHC: Game Tenting Help Center",
        "title": "President",
        "years": "December 2019 - Present",
        "description": "Responsible for team recruiting/onboarding, application infrastructure decisions, task delegation among software teams, and reviewing feature pull requests. Overviewed software development, created responsive about pages using React & React-Router."
      },
      {
        "company": "Duke School of Medicine",
        "title": "IT Technician",
        "years": "January 2019 - Present",
        "description": "Responsible for troubleshooting Windows and Apple products for Duke Medical students, as well as overseeing 1000+ Duke Medical students' devices using Jamf and Airwatch to ensure security compliance."
      }
    ],
    "skills": [
      {
        "name": "Java",
        "level": "70%"
      },
      {
        "name": "Python",
        "level": "70%"
      },
      {
        "name": "ReactJs",
        "level": "60%"
      },
      {
        "name": "HTML/CSS",
        "level": "70%"
      },
      {
        "name": "Linux",
        "level": "50%"
      },
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Troubleshooting",
        "level": "90%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Feed Every Devil",
        "category": "Head Developer",
        "description": "FED is a web application built using Ruby on Rails that allows students to donate or request food points; admins are able to handle these transactions and view transaction history",
        "image": "FEDlogo.png",
        "url": "fed"
      },
      {
        "title": "Game Tenting Help Center",
        "category": "President",
        "description": "Game Tenting Help Center is a mobile & web shift scheduling application that consolidates everything related to K-Ville tenting in one place including line monitor updates, game information, and shift scheduling",
        "image": "gthc.png",
        "url": "https://gthc.io"
      },
      {
        "title": "Work Together",
        "category": "Developer",
        "description": "Woto is a web application that makes office hours a much better experience for students and TAs by providing multiple ways for students to get help during office hours and a plethora of statistics for TAs ",
        "image": "woto_logo.jpg",
        "url": "https://woto.app"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
